<a href="https://colab.research.google.com/github/filchyboy/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS11_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [6]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-12-05 19:16:48--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.204.61
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.204.61|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  95.4MB/s    in 2.1s

2019-12-05 19:16:51 (95.4 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [7]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [8]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [9]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
import pandas as pd

In [0]:
# First I'm going to look at the content of each file to determine which ones 
# I need to use for this assignment. // First aisles.
aisles = pd.read_csv('aisles.csv')
aisles.head()

In [0]:
# First I'm going to look at the content of each file to determine which ones 
# I need to use for this assignment. // Next departments.
departments = pd.read_csv('departments.csv')
departments.head()

#Neither departments.csv nor aisles.csv contain anything of value for this exercise.

In [20]:
# First I'm going to look at the content of each file to determine which ones 
# I need to use for this assignment. // Next prior products.
# I'm dropping columns like a rapper drops rhymes.
prior_products = pd.read_csv('order_products__prior.csv').drop(['reordered','add_to_cart_order'], axis=1)
prior_products.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [21]:
# First I'm going to look at the content of each file to determine which ones 
# I need to use for this assignment. // Next train products.
# I'm dropping columns like a rapper drops rhymes.
train_products = pd.read_csv('order_products__train.csv').drop(['reordered','add_to_cart_order'], axis=1)
train_products.head()

   order_id  product_id
0         1       49302
1         1       11109
2         1       10246
3         1       49683
4         1       43633

In [22]:
# First I'm going to look at the content of each file to determine which ones 
# I need to use for this assignment. // Next orders.
orders = pd.read_csv('orders.csv')
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [23]:
# First I'm going to look at the content of each file to determine which ones 
# I need to use for this assignment. // Next products.
# I'm dropping columns like a rapper drops rhymes.
products = pd.read_csv('products.csv').drop(['aisle_id','department_id'], axis = 1)
products.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [24]:
# Now I'm going to append the train_products to the products_prior and 
# create a new data frame named order_products
order_products = pd.concat([train_products, prior_products])

order_products.shape
order_products.head()

   order_id  product_id
0         1       49302
1         1       11109
2         1       10246
3         1       49683
4         1       43633

In [25]:
# Checking to ensure the two files were concatenated. Shape is proper.
order_products.shape

(33819106, 2)

In [30]:
# Here I am merging the product and order_products dataframes after they've had 
# their unneeded columns stripped out so that I can make a full run through the 
# file to find the most popular products.
# Notice at this point I did not drop columns from orders as I wasn't sure if it
# was going to be used or was needed.
# Checked shape. Notice there's an additional column!
merged_order_products = pd.merge(products, order_products, on='product_id', how='inner')
print(merged_order_products.shape)

(33819106, 3)

In [31]:
# Making sure I have the correct columns left intact. Examining the head. Looks
# good.
# Now I have product_id, product_name, & order_id in one data frame. Still not 
# sure I will have to use the orders.csv file as the merged_order_products file
# should now contain all instance of everything that has been ordered. I should 
# be able to do a simple count on the data frame by either the product_id or
# the product_name and be able to sort that to get my top ten list.
for col in merged_order_products: 
    print(col)
merged_order_products.head()

product_id
product_name
order_id

   product_id                product_name  order_id
0           1  Chocolate Sandwich Cookies      6695
1           1  Chocolate Sandwich Cookies     48361
2           1  Chocolate Sandwich Cookies     63770
3           1  Chocolate Sandwich Cookies     75339
4           1  Chocolate Sandwich Cookies    240996

In [71]:
# After more thought I'm convinced I do not need order_id as the information I 
# seeking is already contained in the existing product_id & product_name facets.
# Dropping the order_id as it's not needed for a count on products.
merged_order_products.drop(['order_id'], axis=1)

          product_id                product_name
0                  1  Chocolate Sandwich Cookies
1                  1  Chocolate Sandwich Cookies
2                  1  Chocolate Sandwich Cookies
3                  1  Chocolate Sandwich Cookies
4                  1  Chocolate Sandwich Cookies
...              ...                         ...
33819101       49688      Fresh Foaming Cleanser
33819102       49688      Fresh Foaming Cleanser
33819103       49688      Fresh Foaming Cleanser
33819104       49688      Fresh Foaming Cleanser
33819105       49688      Fresh Foaming Cleanser

[33819106 rows x 2 columns]

In [0]:
# Create a new dataframe which consists of the merged_order_products data frame
# which has been counted against the product_name column, used python to fetch
# the top ten
top_ten = merged_order_products['product_name'].value_counts()[:10]

In [40]:
# Check the head and sure enough my list presents as the same in the assignment.
top_ten.head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [47]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [59]:
# table2 -> tidy
tidy_table = table1.melt(id_vars='index', value_vars=['treatmenta',
                                                      'treatmentb'])

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

In [60]:
tidy_table

   index    variable  value
0    NaN  treatmenta    NaN
1    NaN  treatmenta   16.0
2    NaN  treatmenta    3.0
3    NaN  treatmentb    2.0
4    NaN  treatmentb   11.0
5    NaN  treatmentb    1.0

In [61]:
# tidy -> table2
wide_table = tidy_table.pivot_table(index='variable', columns='value', values='value')

wide_table

Empty DataFrame
Columns: []
Index: []

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')

In [63]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [76]:
flights.groupby('year')[['passengers']].sum()

      passengers
year
1949        1520
1950        1676
1951        2042
1952        2364
1953        2700
1954        2867
1955        3408
1956        3939
1957        4421
1958        4572
1959        5140
1960        5714

In [77]:
flights.pivot_table('passengers', index='year', columns='month')

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####